app/Http/Controllers/BookController.php

select * from `categories`
select * from `books` where `books`.`id` = '83' limit 1
select * from `users` where `users`.`id` = '2' and `users`.`id` is not null and `users`.`deleted_at` is null limit 1
select `paid_discount`.*, `paid_ebook`.`store_logo`, `paid_ebook`.`store_name` from `paid_discount` inner join `paid_ebook` on `paid_discount`.`book_id` = `paid_ebook`.`book_id` and `paid_discount`.`paid_ebook_id` = `paid_ebook`.`id` where `paid_discount`.`book_id` = '83' and `paid_ebook`.`book_id` = '83'
---
    public function edit($id)
    {
        $categories = Category::all();
        $book = Book::findOrFail($id);
        $username = $book->user_name()->first()->first_name." ".$book->user_name()->first()->last_name;
        $paid = Paid::where('book_id', '=', $id)->get();
        $paidDiscount = DB::table('paid_discount')
        ->join('paid_ebook', function($join){
            $join->on('paid_discount.book_id', '=', 'paid_ebook.book_id')
            ->on('paid_discount.paid_ebook_id', '=', 'paid_ebook.id');
        })
        ->select('paid_discount.*', 'paid_ebook.store_logo', 'paid_ebook.store_name')
        ->where('paid_discount.book_id', '=', $id)
        ->where('paid_ebook.book_id', '=', $id)
        ->get();

select * from `books` where `books`.`id` = '50' limit 1
select * from `books` where `id` = '50' limit 1
select `paid_discount`.*, `paid_ebook`.`store_logo`, `paid_ebook`.`store_name` from `paid_discount` inner join `paid_ebook` on `paid_discount`.`book_id` = `paid_ebook`.`book_id` and `paid_discount`.`paid_ebook_id` = `paid_ebook`.`id` where `paid_discount`.`book_id` = '50' and `paid_ebook`.`book_id` = '50'
select `categories`.*, `books`.*, `users`.`first_name`, `users`.`last_name`, `users`.`name` from `books` inner join `users` on `users`.`id` = `books`.`user_id` inner join `categories` on `books`.`category` = `categories`.`id` where `categories`.`id` = '4' and `categories`.`is_delete` = '0' and `categories`.`status` = 'Active' and `books`.`approve` = '1'
---
    public function view_free_ebook($id)
    {
        $book = Book::findOrFail($id)->where('id', $id);
        $book = $book->first();
        $paid = Book::findOrFail($id)->paid;
        $paidDiscount = DB::table('paid_discount')
        ->join('paid_ebook', function($join){
            $join->on('paid_discount.book_id', '=', 'paid_ebook.book_id')
            ->on('paid_discount.paid_ebook_id', '=', 'paid_ebook.id');
        })
        ->select('paid_discount.*', 'paid_ebook.store_logo', 'paid_ebook.store_name')
        ->where('paid_discount.book_id', '=', $id)
        ->where('paid_ebook.book_id', '=', $id)
        ->get();
        $related_book = DB::table('books')
        ->join('users', 'users.id', '=', 'books.user_id')
        ->join('categories', 'books.category', '=', 'categories.id')
        ->select('categories.*','books.*', 'users.first_name', 'users.last_name', 'users.name')
        ->where('categories.id', '=', $book->category)
        ->where('categories.is_delete', '=', 0)
        ->where('categories.status', '=', 'Active')
        ->where('books.approve', '=', 1)
        ->get();