app/Http/Controllers/Controller.php

    public function __construct()
    {
        app('debugbar')->disable();
        $site_settings = Session::get('site_settings');
        if(empty($site_settings)){
        	$site_settings = Setting::find(1);
        	if(empty($site_settings))
        	{
        		$site_settings = [
        			'site_logo' => 'logo-head.png',
        			'site_title' => 'AmpleRead e-Book',
        			'site_meta' => 'ample,ebook',
        			'admin_email' => 'vinod@mailinator.com',
        			'from_email' => 'vinod@mailinator.com'
        		];
        	}
        	session(['site_settings' =>$site_settings]);
        }
        $site_settings = Session::get('site_settings');

        $categories = Category::where('status', 'Active')->get();
---
select * from `settings` where `settings`.`id` = '1' limit 1
select * from `categories` where `status` = 'Active'