app/Http/Controllers/WelcomeController.php

    public function welcome()
    {
    	$countries = Country::all();
        $books = Book::all();
        $categories = Category::all();
        $special_features = HomeBook::with('home_books')->where('type', 'special_feature')->get();
        $banner_images = Home::all();
        $new_releases = HomeBook::with('home_books')->where('type', 'new_releases')->get();
        $bestsellers  = HomeBook::with('home_books')->where('type', 'bestsellers')->get();
---
select * from `countries`
select * from `books`
select * from `categories`
select * from `admin_special_features` where `type` = 'special_feature'
select * from `books` where `books`.`id` in ('91', '92', '109', '143')
select * from `books` where `books`.`id` in ('119', '153', '156')
select * from `books` where `books`.`id` in ('85', '88', '91', '92')