app/Models/User.php

    public function isAdmin()
    {
        foreach ($this->roles()->get() as $role)
---
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = '2'